Outline.tex
% Created 2021-07-20 Tue 10:02
% Intended LaTeX compiler: pdflatex
\documentclass[journal=accacs,manuscript=article, email=true, layout=traditional]{achemso}
  \setkeys{acs}{biblabel=brackets,super=true,articletitle=False,maxauthors=0}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{url}
\usepackage{siunitx}
\usepackage{mhchem}
\usepackage{graphicx}
\usepackage{color}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{minted}
\usepackage[section]{placeins}
\usepackage[linktocpage, pdfstartview=FitH, colorlinks=true, linkcolor=blue, anchorcolor=blue, citecolor=blue, filecolor=blue, menucolor=blue, urlcolor=blue]{hyperref}
\usepackage{attachfile}
\newcommand{\red}[1]{\textcolor{red}{#1}}
\newcommand{\blue}[1]{\textcolor{blue}{#1}}
\keywords{}
\renewcommand{\thefigure}{\arabic{figure}}
\renewcommand{\thetable}{\arabic{table}}
\usepackage{lmodern}
\usepackage{cleveref}
\author{Craig Waitt}
\affiliation{Department of Chemistry and Biochemistry, University of Notre Dame, Notre Dame, Indiana 46556, United States}
\author{Xuyao Gao}
\affiliation{Department of Chemical and Biomolecular Engineering, University of Notre Dame, Notre Dame, Indiana 4656, United States}
\author{William F. Schneider}
\email{wschneider@nd.edu}
\affiliation{Department of Chemical and Biomolecular Engineering, University of Notre Dame, Notre Dame, Indiana 46556, United States}
\alsoaffiliation{Department of Chemistry and Biochemistry, University of Notre Dame, Notre Dame, Indiana 46556, United States}
\date{}
\title{Sampling Orientational Space of Organic Structure Directing Agents in Zeolites: Genetic Algorithm vs. Classical Mechanics}
\begin{document}

\begin{header}
\end{header}

\newpage

\section{Workflow}
\label{sec:org1147288}

\subsection{Objectives}
\label{sec:orgca6df90}

\begin{enumerate}
\item Develop models to capture/describe the orientational preference a framework (FW) has for a particular organic structure directing agent (OSDA)
\begin{enumerate}
\item Compare Genetic Algorithm (GA) and Classical Molecular Dynamics (CMD) ability to sample global configurational space
\item Compare GA and CMD ability to sample local configuration
\item Compare Drieding force field with DFT
\end{enumerate}
\end{enumerate}

\subsection{Plan of Attack}
\label{sec:org715c911}

\begin{enumerate}
\item \textbf{What is the preferential orientational of a specific OSDA/Zeolite combination}

\begin{enumerate}
\item Develop a model to capture OSDA Orientations
\begin{itemize}
\item Classical molecular dynamics (CMD) at very high temperatures (\(T \geq 5,000\)) to sample different possible orientation
\end{itemize}

\item Compute interaction energy (IE) of all FW and OSDA combinations (maybe free energies):
\begin{itemize}
\item CHA and AEI with TMADA, DMDMP (isomers), and DEDMP (isomers)
\begin{itemize}
\item include LTA and TMA?
\end{itemize}
\item Using CMD at \SI{343}{K} (rigid framework)
\item Using density functional theory with dispersion (DFT-D3) (flexible framework)
\begin{itemize}
\item Rigid Framework as well?
\end{itemize}
\end{itemize}

\item Evaluate orientation and positioning dependence of OSDA in FW
\begin{itemize}
\item Measure the orientation of an OSDA relative to some axis which encompases the cage the OSDA is in
\item Measure the location of the OSDA center of mass is relative to the center of the zeolite cage
\end{itemize}
\end{enumerate}

\item \textbf{What limitations does each model posses?}

\begin{enumerate}
\item GA-DFT is time restrictive compared to CMD. GA allows for ease of global sampling of OSDA in a cage. Framework can be rigid or flexible. Local configuration is relatively fixed (DEDMP for example).

\item CMD is quick. Can sample larger ranges of global configurations. Requires sampling at very high temperatures (5000 K) and resampling at normal temperatures (more steps that GA). Currently can do multiple OSDA's (possible in GA but parents must be made by hand). Framework must be rigid (Drieding). CMD allows OSDA to sample local configurations.

\item Combined GA-CMD-DFT. GA to sample Global configurations. CMD to sample local configurations. DFT to relax FW and get Energy (IE).
\end{enumerate}

\item \textbf{Combined GA-CMD-DFT}

\begin{enumerate}
\item Use GA to sample Global configuration.

\item Identify ``unique'' orientations/configurations

\item Use CMD to sample local configurations of ``unique'' orientations/configurations

\item Identify ``unique'' subset of each orientation/configuration

\item Re-optimize with DFT (or electronic structure) if desired
\end{enumerate}
\end{enumerate}






\section{Results to Date}
\label{sec:orgecc93e8}
\subsection{GA vs CMD (Structures and Energetics)}
\label{sec:orgbc9af27}
Using the parameters discussed above, we will first compare the lowest energy structure using GA and CMD. The table below describes which method provide similar structures. 

\begin{center}
\begin{tabular}{c c c| c c c  }
 \hline
          & CHA &  & & AEI &\\ 
 \hline
 OSDA     & DFT & CMD &  & DFT & CMD \\
 \hline
 TMADA    & Yes & Yes &  & Yes & Yes \\ 
 DMDMP-2c & Yes & Yes &  & Yes & Yes \\  
 DMDMP-3c & Yes & Yes &  & Difference in Glob Min & See Notes\\
 DMDMP-3t & Done & Running &  & Difference in Glob Min & See Notes \\
 DEDMP-2c & Done & Running &  & Difference in Glob Min & Exo/Endo Orient \\
 DEDMP-3c & Done & Running &  & Difference in Glob Min & Exo/Endo Orient \\
 DEDMP-3t & Done & Running &  & Done & Running \\ 
 \hline
\end{tabular}
\end{center}
\end{document}